// Подключение основного файла стилей
import "../scss/style.scss";

// Плагины ============================================================================================================================================================================================================================================================================================================

/* Динамический адаптив */
import "./libs/dynamic_adapt.js";

// Основные модули ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
flsFunctions.isWebp();
/* Модуль для работы с меню (Бургер) */
flsFunctions.menuInit();

/*
Модуль работы с табами
*/
flsFunctions.tabs();

/*
Попапы
*/
// Для включения ??? (подсказок в консоли) передать true * /
flsFunctions.initPopups(false);

// Работа с формами ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Работа с полями формы: добавление классов, работа с placeholder. */
flsForms.formFieldsInit();

/* Oтправка формы со встроенной валидацией полей. false - отключит валидацию */
flsForms.formSubmit(true);

/* Модуль работы с select. Для включения ??? (подсказок в консоли) передать true */
flsForms.formSelect(false);


// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
import "./files/sliders.js";

// Функции работы скроллом ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
import * as flsScroll from "./files/scroll/scroll.js";

// Прочее ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================